# XJTLU GMaster zR
nc: 4  # number of classes
nkpt: 5 # number of keypoints
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.5 # layer channel multiple
dw_conv_kpt: True

# anchors
anchors:
  - [ 26,27,  28,28,  27,30 ]  # P3/8
  - [ 29,29,  29,32,  30,31 ]  # P4/16s
  - [ 30,33,  32,32,  32,34 ]  # P5/32


# YOLOv8 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 3, 2]],  # 0-P1/2
    [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
    [-1, 3, C2f, [128, True]],
    [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
    [-1, 6, C2f, [256, True]],
    [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
    [-1, 6, C2f, [512, True]],
    [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
    [-1, 3, C2f, [1024, True]],
  ]

# yolov7 head
head:
  [
    [-1, 1, SPPF, [1024, 5]],
    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
    [[-1, 6 ], 1, Concat, [1]],  # cat backbone P4
    [-1, 3, C2f, [512]],  # 12

    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
    [[-1, 4 ], 1, Concat, [1]],  # cat backbone P3
    [-1, 3, C2f, [256]],
    [-1, 1, SimAM, [256]], # 16 (P3/8-small)

    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 12 ], 1, Concat, [1]],  # cat head P4
    [-1, 3, C2f, [512]],
    [-1, 1, SimAM, [512]], # 20 (P4/16-medium)

    [-1, 1, Conv, [512, 3, 2]],
    [[-1, 9 ], 1, Concat, [1]],  # cat head P5
    [-1, 3, C2f, [1024]],
    [-1, 1, SimAM, [1024]], # 24 (P5/32-large)
    [[16, 20, 24], 1, IKeypoint, [nc, anchors, nkpt]],  # Detect(P3, P4, P5)
  ]
