# XJTLU GMaster zR
nc: 14  # number of classes
nkpt: 4 # number of keypoints
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.25 # layer channel multiple
dw_conv_kpt: True

# anchors
anchors:
  - [12,10, 19,14, 26,20]  # P3/8
  - [37,31, 61,46, 88,68]  # P4/16
  - [113,105, 193,108, 245,149]  # P5/32

# YOLOv8 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, CBRM, [32]], # 0-P2/4
   [-1, 1, Shuffle_Block, [128, 2]],  # 1-P3/8
   [-1, 3, Shuffle_Block, [128, 1]],  # 2
   [-1, 1, Shuffle_Block, [256, 2]],  # 3-P4/16
   [-1, 7, Shuffle_Block, [256, 1]],  # 4
   [-1, 1, Shuffle_Block, [512, 2]],  # 5-P5/32
   [-1, 3, Shuffle_Block, [512, 1]],  # 6
  ]
head:
  [[-1, 1, SPPFCSPC, [256, 5]],

    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
    [[-1, 4], 1, Concat, [1]],  # cat backbone P4
    [-1, 3, C2f, [128]],  # 10

    [-1, 1, nn.Upsample, [None, 2, 'nearest']],
    [[-1, 2], 1, Concat, [1]],  # cat backbone P3
    [-1, 3, C2f, [128]],  # 13 (P3/8-small)
    [-1, 1, SimAM, [128]],

    [-1, 1, Conv, [128, 3, 2]],
    [[-1, 10], 1, Concat, [1]],  # cat head P4
    [-1, 3, C2f, [256]],  # 17 (P4/16-medium)
    [-1, 1, SimAM, [256]],

    [-1, 1, Conv, [256, 3, 2]],
    [[-1, 7], 1, Concat, [1]],  # cat head P5
    [-1, 3, C2f, [512]],  # 21 (P5/32-large)
    [-1, 1, SimAM, [512]],
    [[13, 17, 21], 1, IKeypoint, [nc, anchors, nkpt]],  # Detect(P3, P4, P5)
  ]
